Merge pull request #1 from AnaresSs/refactor/feedback-improvements
Refactor/feedback improvements
